In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [7]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [8]:
df

    Column1   Column2   Column3
A -0.871633 -1.663459 -1.176455
B -0.683495  0.179019  0.746229
C  1.514323 -1.222462 -0.320710
D  0.307713  0.411793  0.424375

In [9]:
df > -1

   Column1  Column2  Column3
A     True    False    False
B     True     True     True
C     True    False     True
D     True     True     True

In [10]:
boolenDf = df > 0

In [11]:
boolenDf

   Column1  Column2  Column3
A    False    False    False
B    False     True     True
C     True    False    False
D     True     True     True

In [12]:
df[boolenDf]

    Column1   Column2   Column3
A       NaN       NaN       NaN
B       NaN  0.179019  0.746229
C  1.514323       NaN       NaN
D  0.307713  0.411793  0.424375

In [13]:
df[df > 0]

    Column1   Column2   Column3
A       NaN       NaN       NaN
B       NaN  0.179019  0.746229
C  1.514323       NaN       NaN
D  0.307713  0.411793  0.424375

In [14]:
df

    Column1   Column2   Column3
A -0.871633 -1.663459 -1.176455
B -0.683495  0.179019  0.746229
C  1.514323 -1.222462 -0.320710
D  0.307713  0.411793  0.424375

In [15]:
df["Column1"]

A   -0.871633
B   -0.683495
C    1.514323
D    0.307713
Name: Column1, dtype: float64

In [16]:
df["Column1"] > 0

A    False
B    False
C     True
D     True
Name: Column1, dtype: bool

In [17]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
C  1.514323 -1.222462 -0.320710
D  0.307713  0.411793  0.424375

In [18]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
C  1.514323 -1.222462 -0.320710
D  0.307713  0.411793  0.424375

In [19]:
df[df["Column2"] > 0]

    Column1   Column2   Column3
B -0.683495  0.179019  0.746229
D  0.307713  0.411793  0.424375

In [23]:
df[(df["Column1"] > 0) & (df["Column2"] > 0)]

    Column1   Column2   Column3
D  0.307713  0.411793  0.424375

In [24]:
df[(df["Column1"] > 0) | (df["Column2"] > 0)]

    Column1   Column2   Column3
B -0.683495  0.179019  0.746229
C  1.514323 -1.222462 -0.320710
D  0.307713  0.411793  0.424375

In [25]:
df

    Column1   Column2   Column3
A -0.871633 -1.663459 -1.176455
B -0.683495  0.179019  0.746229
C  1.514323 -1.222462 -0.320710
D  0.307713  0.411793  0.424375

In [26]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"])

In [27]:
df

    Column1   Column2   Column3   Column4
A -0.871633 -1.663459 -1.176455  0.189298
B -0.683495  0.179019  0.746229 -1.972680
C  1.514323 -1.222462 -0.320710 -0.800030
D  0.307713  0.411793  0.424375  0.055773

In [28]:
df["Column5"] = randn(4)

In [29]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.871633 -1.663459 -1.176455  0.189298 -0.357544
B -0.683495  0.179019  0.746229 -1.972680 -0.224392
C  1.514323 -1.222462 -0.320710 -0.800030 -0.137241
D  0.307713  0.411793  0.424375  0.055773 -1.167066

In [32]:
df["Column6"] = ["newValue1","NewValue2","newValue3","NewValue4"]

In [33]:
df

    Column1   Column2   Column3   Column4   Column5    Column7    Column6
A -0.871633 -1.663459 -1.176455  0.189298 -0.357544  newValue1  newValue1
B -0.683495  0.179019  0.746229 -1.972680 -0.224392  NewValue2  NewValue2
C  1.514323 -1.222462 -0.320710 -0.800030 -0.137241  newValue3  newValue3
D  0.307713  0.411793  0.424375  0.055773 -1.167066  NewValue4  NewValue4

In [36]:
df.set_index("Column6",inplace =True)

In [37]:
df

            Column1   Column2   Column3   Column4   Column5    Column7
Column6
newValue1 -0.871633 -1.663459 -1.176455  0.189298 -0.357544  newValue1
NewValue2 -0.683495  0.179019  0.746229 -1.972680 -0.224392  NewValue2
newValue3  1.514323 -1.222462 -0.320710 -0.800030 -0.137241  newValue3
NewValue4  0.307713  0.411793  0.424375  0.055773 -1.167066  NewValue4

In [39]:
df.index.names

FrozenList(['Column6'])